In [1]:
import pandas as pd
import numpy as np

In [9]:
df = pd.read_csv(r'data\ds_salaries.csv')

In [23]:
df.head(9)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M
5,2023,SE,FT,Applied Scientist,222200,USD,222200,US,0,US,L
6,2023,SE,FT,Applied Scientist,136000,USD,136000,US,0,US,L
7,2023,SE,FT,Data Scientist,219000,USD,219000,CA,0,CA,M
8,2023,SE,FT,Data Scientist,141000,USD,141000,CA,0,CA,M

In [10]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

### Tratamiento

In [19]:
df.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [29]:
df.shape[0]

2584

In [28]:
df.duplicated().sum()

0

In [26]:
df.drop_duplicates(inplace=True) #Removemos los duplicados ya que no aportan información adicional y pueden afectar el análisis

### EDA

Cual es el tipo de empleo que gana mas dinero?

In [32]:
df['salary'].max()

30400000

In [31]:
df.groupby('job_title')['salary'].mean().sort_values(ascending=False).round(2)

job_title
Head of Machine Learning          6000000.00
Principal Data Architect          3000000.00
Lead Machine Learning Engineer    2548666.67
Lead Data Scientist                928485.33
Data Analytics Lead                922500.00
                                     ...
Insight Analyst                     38500.00
Compliance Data Analyst             30000.00
Autonomous Vehicle Technician       26277.50
Staff Data Analyst                  15000.00
Product Data Scientist               8000.00
Name: salary, Length: 93, dtype: float64

Cual es el tipo de empleo que permite mas trabajo remoto?

In [38]:
df['remote_ratio'].value_counts()

remote_ratio
100    1211
0      1186
50      187
Name: count, dtype: int64

In [39]:
df[df['remote_ratio'] == 100]['job_title'].value_counts()

job_title
Data Engineer                        287
Data Scientist                       237
Data Analyst                         194
Machine Learning Engineer             90
Analytics Engineer                    50
                                    ...
BI Data Engineer                       1
Applied Machine Learning Engineer      1
Compliance Data Analyst                1
Data Quality Analyst                   1
Staff Data Scientist                   1
Name: count, Length: 75, dtype: int64

¿Cual es el salario promedio de los empleados de Data Scientist?

In [41]:
df[df['job_title'] == 'Data Scientist']['salary'].mean().round(2)

286453.71

¿cuantas personas ganan por encima de los 200ks?

In [ ]:
df[df['salary'] > 200000].shape[0]

¿ cual es el salario promedio de los empleados Data Modeler en SE

In [ ]:
df[(df['job_title'] == 'Data Modeler') & (df['company_location'] == 'SE')]['salary'].mean().round(2)

Para los ML Engineer, que diferencia de salario hay entre full time y part time?

In [ ]:
full_time_salary = df[(df['job_title'] == 'ML Engineer') & (df['employment_type'] == 'FT')]['salary'].mean().round(2)
part_time_salary = df[(df['job_title'] == 'ML Engineer') & (df['employment_type'] == 'PT')]['salary'].mean().round(2)
salary_difference = full_time_salary - part_time_salary
salary_difference

Cual es el employment type mas frecuente entre los Business Data Analyst

In [ ]:
df[df['job_title'] == 'Business Data Analyst']['employment_type'].value_counts().idxmax()

En qué país, en cuanto a localización de la compañía, hay mayor ratio de teletrabajo?

In [ ]:
df.groupby('company_location')['remote_ratio'].mean().sort_values(ascending=False).head(1)